#Theory questions
## Что такое итераторы и для чего они применяются?
- 1 Итераторы - это способ обращения к элементам различных контейнеров, используя практически один и тот же синтаксис.
## Что такое диапазон?
- 2 Диапазон - это два итератора на один контейнер, при этом один из "левее".
## Почему стандартные алгоритмы работают с итераторами, а не с контейнерами напрямую?
- 3 Алгоритмы работают с итераторами, а не с контейнерами, потому каждый контейнер имеет свои особенности и невозможно создать универсальный алгоритм работы с каждым из них.

